arduino/Arduino/build/linux/arduino-1.8.14/hardware/tools/avr/avr/include/avr/iom3250pa.h
/* Reserved [0x8C..0xAF] */

#define TCCR2A  _SFR_MEM8(0xB0)
#define CS20    0
#define CS21    1
#define CS22    2
#define WGM21   3
#define COM2A0  4
#define COM2A1  5
#define WGM20   6
#define FOC2A   7

/* Reserved [0xB1] */

#define TCNT2   _SFR_MEM8(0xB2)

#define OCR2A   _SFR_MEM8(0xB3)

/* Reserved [0xB4..0xB5] */

#define ASSR    _SFR_MEM8(0xB6)
#define TCR2UB  0
#define OCR2UB  1
#define TCN2UB  2
#define AS2     3
#define EXCLK   4

/* Reserved [0xB7] */

#define USICR   _SFR_MEM8(0xB8)
#define USITC   0
#define USICLK  1
#define USICS0  2
#define USICS1  3
#define USIWM0  4
#define USIWM1  5
#define USIOIE  6
#define USISIE  7

#define USISR   _SFR_MEM8(0xB9)
#define USICNT0 0
#define USICNT1 1
#define USICNT2 2
#define USICNT3 3
#define USIDC   4
#define USIPF   5
#define USIOIF  6
#define USISIF  7

#define USIDR   _SFR_MEM8(0xBA)

/* Reserved [0xBB..0xBF] */

#define UCSR0A  _SFR_MEM8(0xC0)
#define MPCM0   0
#define U2X0    1
#define UPE0    2
#define DOR0    3
#define FE0     4
#define UDRE0   5
#define TXC0    6
#define RXC0    7

#define UCSR0B  _SFR_MEM8(0xC1)
#define TXB80   0
#define RXB80   1
#define UCSZ02  2
#define TXEN0   3
#define RXEN0   4
#define UDRIE0  5
#define TXCIE0  6
#define RXCIE0  7

#define UCSR0C  _SFR_MEM8(0xC2)
#define UCPOL0  0
#define UCSZ00  1
#define UCSZ01  2
#define USBS0   3
#define UPM00   4
#define UPM01   5
#define UMSEL0  6

/* Reserved [0xC3] */

/* Combine UBRR0L and UBRR0H */
#define UBRR0   _SFR_MEM16(0xC4)

#define UBRR0L  _SFR_MEM8(0xC4)
#define UBRR0H  _SFR_MEM8(0xC5)

#define UDR0    _SFR_MEM8(0xC6)

/* Reserved [0xC7..0xD7] */

#define PINH    _SFR_MEM8(0xD8)
#define PINH7   7
#define PINH6   6
#define PINH5   5
#define PINH4   4
#define PINH3   3
#define PINH2   2
#define PINH1   1
#define PINH0   0

#define DDRH    _SFR_MEM8(0xD9)
#define DDRH7   7
// Inserted "DDH7" from "DDRH7" due to compatibility
#define DDH7    7
#define DDRH6   6
// Inserted "DDH6" from "DDRH6" due to compatibility
#define DDH6    6
#define DDRH5   5
// Inserted "DDH5" from "DDRH5" due to compatibility
#define DDH5    5
#define DDRH4   4
// Inserted "DDH4" from "DDRH4" due to compatibility
#define DDH4    4
#define DDRH3   3
// Inserted "DDH3" from "DDRH3" due to compatibility
#define DDH3    3
#define DDRH2   2
// Inserted "DDH2" from "DDRH2" due to compatibility
#define DDH2    2
#define DDRH1   1
// Inserted "DDH1" from "DDRH1" due to compatibility
#define DDH1    1
#define DDRH0   0
// Inserted "DDH0" from "DDRH0" due to compatibility
#define DDH0    0

#define PORTH   _SFR_MEM8(0xDA)
#define PORTH7  7
#define PORTH6  6
#define PORTH5  5
#define PORTH4  4
#define PORTH3  3
#define PORTH2  2
#define PORTH1  1
#define PORTH0  0

#define PINJ    _SFR_MEM8(0xDB)
#define PINJ6   6
#define PINJ5   5
#define PINJ4   4
#define PINJ3   3
#define PINJ2   2
#define PINJ1   1
#define PINJ0   0

#define DDRJ    _SFR_MEM8(0xDC)
#define DDRJ6   6
// Inserted "DDJ6" from "DDRJ6" due to compatibility
#define DDJ6    6
#define DDRJ5   5
// Inserted "DDJ5" from "DDRJ5" due to compatibility
#define DDJ5    5
#define DDRJ4   4
// Inserted "DDJ4" from "DDRJ4" due to compatibility
#define DDJ4    4
#define DDRJ3   3
// Inserted "DDJ3" from "DDRJ3" due to compatibility
#define DDJ3    3
#define DDRJ2   2
// Inserted "DDJ2" from "DDRJ2" due to compatibility
#define DDJ2    2
#define DDRJ1   1
// Inserted "DDJ1" from "DDRJ1" due to compatibility
#define DDJ1    1
#define DDRJ0   0
// Inserted "DDJ0" from "DDRJ0" due to compatibility
#define DDJ0    0

#define PORTJ   _SFR_MEM8(0xDD)
#define PORTJ6  6
#define PORTJ5  5
#define PORTJ4  4
#define PORTJ3  3
#define PORTJ2  2
#define PORTJ1  1
#define PORTJ0  0



/* Values and associated defines */


#define SLEEP_MODE_IDLE (0x00<<1)
#define SLEEP_MODE_ADC (0x01<<1)
#define SLEEP_MODE_PWR_DOWN (0x02<<1)
#define SLEEP_MODE_PWR_SAVE (0x03<<1)
#define SLEEP_MODE_STANDBY (0x06<<1)

/* Interrupt vectors */
/* Vector 0 is the reset vector */
/* External Interrupt Request 0 */
#define INT0_vect            _VECTOR(1)
#define INT0_vect_num        1

/* Pin Change Interrupt Request 0 */
#define PCINT0_vect            _VECTOR(2)
#define PCINT0_vect_num        2

/* Pin Change Interrupt Request 1 */
#define PCINT1_vect            _VECTOR(3)
#define PCINT1_vect_num        3

/* Timer/Counter2 Compare Match */
#define TIMER2_COMP_vect            _VECTOR(4)
#define TIMER2_COMP_vect_num        4

/* Timer/Counter2 Overflow */
#define TIMER2_OVF_vect            _VECTOR(5)
#define TIMER2_OVF_vect_num        5

/* Timer/Counter1 Capture Event */
#define TIMER1_CAPT_vect            _VECTOR(6)
#define TIMER1_CAPT_vect_num        6

/* Timer/Counter1 Compare Match A */
#define TIMER1_COMPA_vect            _VECTOR(7)
#define TIMER1_COMPA_vect_num        7

/* Timer/Counter Compare Match B */
#define TIMER1_COMPB_vect            _VECTOR(8)
#define TIMER1_COMPB_vect_num        8

/* Timer/Counter1 Overflow */
#define TIMER1_OVF_vect            _VECTOR(9)
#define TIMER1_OVF_vect_num        9

/* Timer/Counter0 Compare Match */
#define TIMER0_COMP_vect            _VECTOR(10)
#define TIMER0_COMP_vect_num        10

/* Timer/Counter0 Overflow */
#define TIMER0_OVF_vect            _VECTOR(11)
#define TIMER0_OVF_vect_num        11

/* SPI Serial Transfer Complete */
#define SPI_STC_vect            _VECTOR(12)
#define SPI_STC_vect_num        12

/* USART, Rx Complete */
#define USART_RX_vect            _VECTOR(13)
#define USART_RX_vect_num        13

/* USART Data register Empty */
#define USART_UDRE_vect            _VECTOR(14)
#define USART_UDRE_vect_num        14

/* USART0, Tx Complete */
#define USART0_TX_vect            _VECTOR(15)
#define USART0_TX_vect_num        15

/* USI Start Condition */
#define USI_START_vect            _VECTOR(16)
#define USI_START_vect_num        16

/* USI Overflow */
#define USI_OVERFLOW_vect            _VECTOR(17)
#define USI_OVERFLOW_vect_num        17

/* Analog Comparator */
#define ANALOG_COMP_vect            _VECTOR(18)
#define ANALOG_COMP_vect_num        18

